import random


def get_ip():
    uer_ips = [
        '212.39.27.210:31853', '176.98.133.189:8080', '103.9.134.49:65301', '118.98.123.19:53281',
        '88.199.164.153:8080', '203.176.135.98:39532', '36.89.185.219:53281', '185.136.158.8:1080',
        '103.235.199.9:46621', '190.122.186.212:8080', '198.50.251.188:808', '221.176.206.29:8060',
        '209.182.217.167:8080', '41.139.147.34:8080', '220.135.132.82:61002', '118.174.233.76:43865',
        '103.109.92.22:53281', '201.236.145.74:8080', '118.174.46.147:45330', '164.160.142.49:54233',
        '186.88.100.70:8080', '140.227.213.35:3128', '188.191.63.239:43090', '117.191.11.110:8080',
        '202.141.250.25:8080', '177.4.168.85:53281', '79.98.77.242:8080', '185.144.67.14:8080', '195.191.250.38:3128',
        '103.59.212.93:8080', '69.10.47.129:8080', '111.177.182.186:9999', '202.146.2.131:47217',
        '95.210.231.144:58864', '31.132.218.252:32423', '150.95.151.68:8187', '154.73.65.125:48108',
        '122.102.39.225:35564', '210.77.24.191:1080', '185.88.255.17:8080', '103.76.175.94:8080', '103.9.190.223:57330',
        '110.168.24.103:8888', '103.46.232.129:82', '92.51.44.1:8080', '193.93.78.240:32231', '206.201.0.27:8080',
        '31.44.255.228:4550', '118.174.232.181:38659', '46.229.187.169:53281', '123.231.237.137:35806',
        '81.92.144.25:53281', '182.16.173.195:3128', '46.229.250.111:54431', '89.22.210.191:41258',
        '182.74.85.230:51214', '213.141.93.60:34362', '147.135.206.233:3128', '138.94.160.57:33173',
        '158.46.43.137:48236', '180.250.141.229:8080', '103.36.101.6:23500', '185.44.27.191:45378', '61.8.66.178:8080',
        '102.176.160.14:59490', '190.72.13.237:8080', '1.10.187.17:45321', '162.255.169.177:52472',
        '185.108.215.213:36939', '213.128.9.204:35549', '182.23.38.244:58276', '103.225.228.217:58732',
        '113.121.241.19:1133', '206.40.115.2:8080', '82.99.223.94:47209', '177.75.161.206:3128', '86.57.219.181:23500',
        '103.14.196.2:53281', '95.47.136.185:61598', '181.167.9.105:80', '185.144.64.57:8080']

    user_ips = random.choice(uer_ips)  # random.choice(),从列表中随机抽取一个对象
    # print('您当前的UA为',user_agent)
    return user_ips


def get_ua():
    user_agents = [
        'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/39.0.2171.95 Safari/537.36 OPR/26.0.1656.60',
        'Opera/8.0 (Windows NT 5.1; U; en)',
        'Mozilla/5.0 (Windows NT 5.1; U; en; rv:1.8.1) Gecko/20061208 Firefox/2.0.0 Opera 9.50',
        'Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; en) Opera 9.50',
        'Mozilla/5.0 (Windows NT 6.1; WOW64; rv:34.0) Gecko/20100101 Firefox/34.0',
        'Mozilla/5.0 (X11; U; Linux x86_64; zh-CN; rv:1.9.2.10) Gecko/20100922 Ubuntu/10.10 (maverick) Firefox/3.6.10',
        'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/534.57.2 (KHTML, like Gecko) Version/5.1.7 Safari/534.57.2 ',
        'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/39.0.2171.71 Safari/537.36',
        'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.11 (KHTML, like Gecko) Chrome/23.0.1271.64 Safari/537.11',
        'Mozilla/5.0 (Windows; U; Windows NT 6.1; en-US) AppleWebKit/534.16 (KHTML, like Gecko) Chrome/10.0.648.133 Safari/534.16',
        'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/30.0.1599.101 Safari/537.36',
        'Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0) like Gecko',
        'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/536.11 (KHTML, like Gecko) Chrome/20.0.1132.11 TaoBrowser/2.0 Safari/536.11',
        'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.1 (KHTML, like Gecko) Chrome/21.0.1180.71 Safari/537.1 LBBROWSER',
        'Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; QQDownload 732; .NET4.0C; .NET4.0E)',
        'Mozilla/5.0 (Windows NT 5.1) AppleWebKit/535.11 (KHTML, like Gecko) Chrome/17.0.963.84 Safari/535.11 SE 2.X MetaSr 1.0',
        'Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1; Trident/4.0; SV1; QQDownload 732; .NET4.0C; .NET4.0E; SE 2.X MetaSr 1.0) ',
    ]
    user_agent = random.choice(user_agents)  # random.choice(),从列表中随机抽取一个对象
    # print('您当前的UA为',user_agent)
    return user_agent